УчетВУправляющихДляГит1/src/Catalogs/ШтатноеРасписание/ШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтатноеРасписание</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПрофессии</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовТарифнаяСтавкаОклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоплатаЗаПеревозкуОпасныхГрузов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавкаСДоплатой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вредность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СеверныеРайоные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСВредностьюНадбавкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/ШтатноеРасписание/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НаименованиеПрофессииПриИзменении(Элемент)
	Объект.Наименование = Объект.НаименованиеПрофессии;
КонецПроцедуры

&НаКлиенте
Процедура ДоплатаЗаПеревозкуОпасныхГрузовПриИзменении(Элемент)
	   ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура ВредностьПриИзменении(Элемент)
	ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура ПремияПриИзменении(Элемент)
	ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура СеверныеРайоныеПриИзменении(Элемент)
	ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Процедура ТарифнаяСтавкаПриИзменении(Элемент)
	  ОбновитьИтог();
КонецПроцедуры

&НаКлиенте
Функция УзнатьПроцент(процент)
	ГотовыйПроцент = (100 + процент) / 100 ;
	возврат ГотовыйПроцент;
КонецФункции

&НаКлиенте
Процедура ОбновитьИтог()
   Объект.ТарифнаяСтавкаСДоплатой = Объект.ТарифнаяСтавка *  УзнатьПроцент(Объект.Вредность) *  УзнатьПроцент(Объект.ДоплатаЗаПеревозкуОпасныхГрузов) *  УзнатьПроцент(Объект.Премия) *  УзнатьПроцент(Объект.СеверныеРайоные); 
   Объект.ТарифСВредностьюНадбавкой = Объект.ТарифнаяСтавка *  УзнатьПроцент(Объект.Вредность) *  УзнатьПроцент(Объект.ДоплатаЗаПеревозкуОпасныхГрузов);
КонецПроцедуры
